print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')
print("Welcome to Treasure Island.")
print("Your mission is to find the treasure.") 

#https://www.draw.io/?lightbox=1&highlight=0000ff&edit=_blank&layers=1&nav=1&title=Treasure%20Island%20Conditional.drawio#Uhttps%3A%2F%2Fdrive.google.com%2Fuc%3Fid%3D1oDe4ehjWZipYRsVfeAx2HyB7LCQ8_Fvi%26export%3Ddownload

#Write your code below this line 👇

p1 = input("You reach a CrossRoad, you can either go left or right.Both paths look the same.Type 'left' or 'right'. ").lower()

if(p1 =='left'):
    p2=input("You chose Left. \n You walk a little further ,you see water.\n You can either Swim or wait for sometime for the water to go down.\nType 'swim' to swim or 'waiting' to wait").lower()
    if p2 =='swim':
        print('𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼 \n 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼\n 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼')
        print('\n\n\n***********************************\n\n\nYou decided to swim, you didnt realise that the water was infested with Human Eating Trout.\n You are Dead.\nGame Over.˙◠˙\n\n\n***********************************\n\n\n')
        print('𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼 \n 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼\n 𓇼 ⋆｡˚ 𓆝⋆｡˚ 𓇼')
    elif p2 =='waiting':
        p3 = input("You chose to wait. As you wait, you see the water level going down.\nThree doors Emerge :Red,Yellow and Blue.\nChoose a Door, type 'red' for red door, 'yellow' for yellow door or 'blue' for blue door ")
        if p3 =='red':
            print('''⠀⠀⠀⠀⠀⠀⢱⣆⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠈⣿⣷⡀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣧⠀⠀⠀
⠀⠀⠀⠀⡀⢠⣿⡟⣿⣿⣿⡇⠀⠀
⠀⠀⠀⠀⣳⣼⣿⡏⢸⣿⣿⣿⢀⠀
⠀⠀⠀⣰⣿⣿⡿⠁⢸⣿⣿⡟⣼⡆
⢰⢀⣾⣿⣿⠟⠀⠀⣾⢿⣿⣿⣿⣿
⢸⣿⣿⣿⡏⠀⠀⠀⠃⠸⣿⣿⣿⡿
⢳⣿⣿⣿⠀⠀⠀⠀⠀⠀⢹⣿⡿⡁
⠀⠹⣿⣿⡄⠀⠀⠀⠀⠀⢠⣿⡞⠁
⠀⠀⠈⠛⢿⣄⠀⠀⠀⣠⠞⠋⠀⠀
⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀''')
            print('You got Burned!!!!!!!!!\n Game Over ˙◠˙ ')


        if p3=='blue':
            print("\n\n\n***********************************\n\n\n")
            print('''
                   (    )
                  ((((()))
                  |o\ /o)|
                  ( (  _')
                   (._.  /\__
                  ,\___,/ '  ')
    '.,_,,       (  .- .   .    )
     \   \\     ( '        )(    )
      \   \\    \.  _.__ ____( .  |
       \  /\\   .(   .'  /\  '.  )
        \(  \\.-' ( /    \/    \)
         '  ()) _'.-|/\/\/\/\/\|
             '\\ .( |\/\/\/\/\/|
               '((  \    /\    /
               ((((  '.__\/__.')
                ((,) /   ((()   )
                 "..-,  (()("   /
            pils  _//.   ((() ."
          _____ //,/" ___ ((( ', ___
                           ((  )
                            / /
                          _/,/'
                        /,/,"''')            
            
            print("you decided to take the Blue door. \nA WILD DEMON APPEARS!!!!! YOU ARE KILLED!!!!!!!!!.")
            print("\nGame Over. ˙◠˙")
            print('\n\n\n***********************************\n\n\n')

        if p3=='yellow':
            print('''            88                                                       
            ""              ,d                                       
                            88                                       
8b       d8 88  ,adPPYba, MM88MMM ,adPPYba,  8b,dPPYba, 8b       d8  
`8b     d8' 88 a8"     ""   88   a8"     "8a 88P'   "Y8 `8b     d8'  
 `8b   d8'  88 8b           88   8b       d8 88          `8b   d8'   
  `8b,d8'   88 "8a,   ,aa   88,  "8a,   ,a8" 88           `8b,d8'    
    "8"     88  `"Ybbd8"'   "Y888 `"YbbdP"'  88             Y88'     
                                                            d8'      
                                                           d8'     ''')
            
            print('YOU WON!!!!!!!!!!!!!!!!')

        else:
            print('You didnt choose any door, you died.')
            print('''
                     _                
 _   _  ___  _   _  | | ___  ___  ___ 
| | | |/ _ \| | | | | |/ _ \/ __|/ _ \
| |_| | (_) | |_| | | | (_) \__ |  __/
 \__, |\___/ \__,_| |_|\___/|___/\___|
 |___/                                
''')
    else:
            print('You didnt choose any door, you died.')
            print('''
                     _                
 _   _  ___  _   _  | | ___  ___  ___ 
| | | |/ _ \| | | | | |/ _ \/ __|/ _ \
| |_| | (_) | |_| | | | (_) \__ |  __/
 \__, |\___/ \__,_| |_|\___/|___/\___|
 |___/                                
''')

else:
    print("\n\n\n***********************************\n\n\n")
          
    print('''⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠟⠛⠛⠛⠛⠛⠛⠛⠛⠻⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⡿⠛⠋⠁⠀⠀⢀⣀⣀⣀⣠⣤⣤⣄⣀⣀⣀⡀⠀⠀⠈⠙⠛⢿⣿⣿⣿
⣿⡿⠃⠀⢀⣤⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⡀⠀⠘⢿⣿
⣿⡇⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⢸⣿
⣿⣷⡄⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⢠⣾⣿
⣿⣿⣿⣷⣤⣌⡙⠛⠻⠿⠿⢿⣿⣿⣿⣿⣿⣿⡿⠿⠿⠟⠛⢋⣡⣤⣾⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣦⣤⣤⣤⣤⣤⣤⣤⣤⣴⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿''')
          
    print("you decided to Take a right. \nYou walk a little further and you Fall into a hole.")
    print("\nGame Over. ˙◠˙")
    print('\n\n\n***********************************\n\n\n')



